IdeaRS.OpenModel.Detail.ReinforcementGroup
Base class representing group reinforcement in IDEA StatiCa Detail

IdeaRS.OpenModel.Detail.ReinforcementGroup.Diameter
Diameter o reinforcement

IdeaRS.OpenModel.Detail.ReinforcementGroup.NumOfBarsInLayer
Number of bars in layer

IdeaRS.OpenModel.Detail.ReinforcementGroup.CoverFromSetting
Use cover from DetailModelSetting

IdeaRS.OpenModel.Detail.ReinforcementGroup.Cover
Cover of reinforcement

IdeaRS.OpenModel.Detail.ReinforcementGroup.EndsTypeBeg
End type of the beginning of reinforcement bar

IdeaRS.OpenModel.Detail.ReinforcementGroup.EndsTypeEnd
End type of the end of reinforcement bar

IdeaRS.OpenModel.Detail.ReinforcementGroup.DiameterOfMandrel
Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars